microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33cdv64mc106/hal/hardware_access_functions.c
                }
                else
                {
                    pGateDriver->tryAgainCount = GATE_DRIVER_TRYCOUNT_MAX;
                    pGateDriver->configState = GATE_DRIVER_CONFIG_ERROR;
                }
            break;
            case GATE_DRIVER_CONFIG_CONNECTED:
                pGateDriver->configState = HAL_GateDriver_Install(pGateDriver);
                if (pGateDriver->configState==GATE_DRIVER_CONFIG_INSTALLED)
                {
                    pGateDriver->activeState = GATE_DRIVER_OP_READY;
                    pGateDriver->tryAgainCount = 0;
                }
            break;
                /* After configuring/installing the gate driver this function 
                 * (i.e. when configState = GATE_DRIVER_CONFIG_INSTALLED,
                 * does not have any further actions to perform,hence
                 * function exit by returning configState */
            case GATE_DRIVER_CONFIG_INSTALLED:
                /* Similarly ,if an error is encountered ,it 
                 * indicates there is some issue with communication channel,
                 * or the configuration message sent to the gate driver or 
                 * similar.
                 * This (configState = GATE_DRIVER_CONFIG_ERROR) ,requires 
                 * attention from the user,and hence function does nothing and
                 * returns configState to the application indicating the same.*/
            case GATE_DRIVER_CONFIG_ERROR:

            default:
            break;  
        }
    }
    return pGateDriver->configState;
}

/**
 * Hardware Access Function to read the Gate Driver Status 
 * @param pGateDriver gate driver data
 * @return GATEDRIVER_HANDLER_STATE returns the task status
 * @example
 * <code>
 * status = HAF_GateDriver_Status(GATEDRIVER_A);
 * </code>
 */
GATE_DRIVER_HANDLER_STATE HAL_GateDriver_Status(GATE_DRIVER_OBJ *pGateDriver)
{    
    /* Waits for  Gate Driver Scheduler Timeout,if activated ; 
     * This allows wait states between different events */
    if ((HAL_GateDriver_SchedulerRun(&pGateDriver->timeout) == true))
    {

        /* If Gate Driver internal Operation state anything other than 
         * GATE_DRIVER_OP_NOT_READY ,GATE_DRIVER_OP_TRYAGAIN,
         * Gate Driver operation status can be requested */
        if (pGateDriver->activeState == GATE_DRIVER_OP_TRYAGAIN)
        {
            if (pGateDriver->tryAgainCount < GATE_DRIVER_TRYCOUNT_MAX)
            {
                pGateDriver->tryAgainCount++;
                pGateDriver->statusRegIndex = 0;
                pGateDriver->activeState = GATE_DRIVER_OP_READY;
            }
            else
            {
                pGateDriver->tryAgainCount = GATE_DRIVER_TRYCOUNT_MAX;
                pGateDriver->statusRegIndex = 0;
                pGateDriver->activeState = GATE_DRIVER_OP_ERROR;
            }
        }
        else if (pGateDriver->activeState != GATE_DRIVER_OP_NOT_READY)
        {
            /* Call the Gate Driver read Status Function */
            pGateDriver->activeState = HAL_GateDriver_ReadStatus(pGateDriver);
        }
    }
    /* Returns the Gate Driver Operation Status */
    return pGateDriver->activeState;
}

/**
 * Function to Initialize the Gate Driver 
 * @param pGateDriver gate driver data
 * @return true = success false = failure
 * @example
 * <code>
 * HAL_GateDriver_Initialize(&gateDriver);
 * </code>
 */
static bool HAL_GateDriver_Initialize(GATE_DRIVER_OBJ *pGateDriver)
{
    /* Resets the Gate Driver Object */
    memset(pGateDriver,0,sizeof(GATE_DRIVER_OBJ));
    
    /* Initialize the CE signal port SFR and bit mask */
    pGateDriver->chipEnablePort = BSP_LATCH_GATE_DRIVER_A_CE_PORT;
    pGateDriver->chipEnableMask = 1<<BSP_LATCH_GATE_DRIVER_A_CE_BIT;
    
    /* Ensures  that the Gate Driver is disabled */
    HAL_GateDriver_Disable(pGateDriver);
    /* Initialize Gate Driver Command Options*/
    pGateDriver->cmd0Data.byte = 0;
    pGateDriver->cmd0Data.sleepMode = GATE_DRIVER_ENTERS_STANDBY_MODE;
    pGateDriver->cmd0Data.extFETUVLockOut = GATE_DRIVER_EXTFET_UVLO_ENABLED;
    pGateDriver->cmd0Data.extFETSCDetection = GATE_DRIVER_EXTFET_SCDETECT_ENABLED;
    pGateDriver->cmd0Data.extFETOCLimit = GATE_DRIVER_EXTFET_OCLIM_1V; 
        
    pGateDriver->cmd2Data.byte = 0;
    pGateDriver->cmd2Data.blankingTime = GATE_DRIVER_BLANKING_4000nS;
    pGateDriver->cmd2Data.deadTime = GATE_DRIVER_DEADTIME_2000nS;
    
    /* Store Pointer to Host Interface structure */
    pGateDriver->pHostInterface = &gateDriverInterface[pGateDriver->gateDriverID];
    /* Store Gate Driver ID back in the Gate Driver Structure*/
    /* Function call to initialize Communication Interface between controller 
     and Gate Driver*/
    return HAL_GateDriver_Initialize_CommChannel(pGateDriver);
}

/**
 * Function to enable the Gate Driver. The function sets the chip enable pin 
 * of the gate driver(CE = 1) by holding the port pin 'HIGH'.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Enable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_Enable(GATE_DRIVER_OBJ *pGateDriver)
{
   *(pGateDriver->chipEnablePort) |= pGateDriver->chipEnableMask;
}

/**
 * Function to disable the Gate Driver.The function resets the chip enable pin 
 * of the gate driver(CE = 0) by holding the port pin 'LOW'.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Disable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_Disable(GATE_DRIVER_OBJ *pGateDriver)
{
   *(pGateDriver->chipEnablePort) &= ~pGateDriver->chipEnableMask;
}

/**
 * Function to establish communication interface between gate driver and 
 * controller 
 * @param pHostInterface - pointer to the Host Interface
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Connect(&hostInterface);
 * </code>
 */
void HAL_GateDriver_Connect(GATE_DRIVER_HOST_INTERFACE* pHostInterface)
{ 
    uint16_t baudRate = pHostInterface->baudRateScaler;
    pHostInterface->InterruptReceiveDisable();
    pHostInterface->InterruptReceiveFlagClear();
    pHostInterface->InterruptTransmitDisable();
    pHostInterface->InterruptTransmitFlagClear();
    pHostInterface->Initialize();
    pHostInterface->SpeedModeStandard();
    pHostInterface->BaudRateDividerSet(baudRate);
    pHostInterface->ModuleEnable();
    pHostInterface->TransmitModeEnable();
    pHostInterface->status =  GATE_DRIVER_INTERFACE_ENABLED;
}

/**
 * Function configure the gate driver by writing to Driver Configuration 
 * Registers 0-2.This is achieved by sending commands SET_CONFIG_0(0x81),
 * SET_CONFIG_1(0x83),SET_CONFIG_2(0X87) along with value/option to be written 
 * in to driver configuration registers.in response to command sent by the host.
 * Also the HAL_GateDriver_Install() validates the acknowledgment message from 
 * driver to confirm the successful receipt of commands and  options.
 * 
 * @param pGateDriver gate driver data
 * @return GATE_DRIVER_CONFIG_STATE status of the Gate Driver configuration
 * @example
 * <code>
 * HAL_GateDriver_Install(&gateDriver);
 * </code>
 */
GATE_DRIVER_CONFIG_STATE HAL_GateDriver_Install(GATE_DRIVER_OBJ* pGateDriver)
{ 
    uint16_t ackData[4];
    GATE_DRIVER_CONFIG_STATE state = GATE_DRIVER_CONFIG_CONNECTED; 
    switch(pGateDriver->installState)
    {
        case GATE_DRIVER_STATE_CMD_SET_CFG0:
            BSP_UART2_ConfigureTransmitPin();
            pGateDriver->pHostInterface->ReceiveBufferEmpty();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_SET_CFG0);
            HAL_GateDriver_Write(pGateDriver->pHostInterface,pGateDriver->cmd0Data.byte);
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_SETRXPIN_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_RX_CFG0;
        break;
        case GATE_DRIVER_STATE_ACK_RX_CFG0:
            BSP_UART2_ConfigureRecievePin();
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_SET_CFG0;

        break;
        case GATE_DRIVER_STATE_ACK_SET_CFG0:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[3] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG2;
            if (ackData[0] != GATE_DRIVER_CMD_SET_CFG0)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[1] != pGateDriver->cmd0Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN; 
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[2] != GATE_DRIVER_ACK_SET_CFG0)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[3] != pGateDriver->cmd0Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
        break;
        case GATE_DRIVER_STATE_CMD_SET_CFG2:
            BSP_UART2_ConfigureTransmitPin();
            pGateDriver->pHostInterface->ReceiveBufferEmpty();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_SET_CFG2);
            HAL_GateDriver_Write(pGateDriver->pHostInterface,pGateDriver->cmd2Data.byte);
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_SETRXPIN_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_RX_CFG2;
        break;
        case GATE_DRIVER_STATE_ACK_RX_CFG2:
            BSP_UART2_ConfigureRecievePin();
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_ACK_SET_CFG2;

        break;
        case GATE_DRIVER_STATE_ACK_SET_CFG2:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[3] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            state = GATE_DRIVER_CONFIG_INSTALLED;
            if (ackData[0] != GATE_DRIVER_CMD_SET_CFG2)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[1] != pGateDriver->cmd2Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN; 
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[2] != GATE_DRIVER_ACK_SET_CFG2)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }
            if (ackData[3] != pGateDriver->cmd2Data.byte)
            {
                state = GATE_DRIVER_CONFIG_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
                pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
            }

        break;
        default:
            state = GATE_DRIVER_CONFIG_TRYAGAIN;
            pGateDriver->timeout = GATE_DRIVER_SETCONFIG_TIMEOUT;
            pGateDriver->installState = GATE_DRIVER_STATE_CMD_SET_CFG0;
        break;
    }
    return state;
}

/**
 * Function to read the status from Gate Driver 
 * @param pGateDriver gate driver data
 * @return GATE_DRIVER_OPERATION_STATE status of the Gate Driver Status Read
 * @example
 * <code>
 * HAL_GateDriver_ReadStatus(&gateDriver);
 * </code>
 */
GATE_DRIVER_OPERATION_STATE HAL_GateDriver_ReadStatus(GATE_DRIVER_OBJ* pGateDriver)
{ 
    GATE_DRIVER_OPERATION_STATE state = GATE_DRIVER_OP_BUSY;
    uint16_t ackData[3];
    switch(pGateDriver->statusRegIndex)
    {
        case GATE_DRIVER_STATE_CMD_READ_STATUS0:
            BSP_UART2_ConfigureTransmitPin();
            pGateDriver->pHostInterface->ReceiveBufferEmpty();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_GET_STATUS0);
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_SETRXPIN_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_RX_STATUS0;
        break;
        case GATE_DRIVER_STATE_ACK_RX_STATUS0:
            BSP_UART2_ConfigureRecievePin();
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_READ_STATUS0;
        break;
        case GATE_DRIVER_STATE_ACK_READ_STATUS0:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS1;
            if (ackData[0] != GATE_DRIVER_CMD_GET_STATUS0)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (ackData[1] != GATE_DRIVER_ACK_GET_STATUS0)
            {
                state = GATE_DRIVER_OP_TRYAGAIN; 
                pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->status0Data.byte = (uint8_t)ackData[2];

        break;
        case GATE_DRIVER_STATE_CMD_READ_STATUS1:
            BSP_UART2_ConfigureTransmitPin();
            pGateDriver->pHostInterface->ReceiveBufferEmpty();
            HAL_GateDriver_Write(pGateDriver->pHostInterface,GATE_DRIVER_CMD_GET_STATUS1);
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_SETRXPIN_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_RX_STATUS1;
        break;
        case GATE_DRIVER_STATE_ACK_RX_STATUS1:
            BSP_UART2_ConfigureRecievePin();
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_ACK_READ_STATUS1;
        break;
        case GATE_DRIVER_STATE_ACK_READ_STATUS1:
            ackData[0] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[1] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            ackData[2] = HAL_GateDriver_Read(pGateDriver->pHostInterface);
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            if (ackData[0] != GATE_DRIVER_CMD_GET_STATUS1)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (ackData[1] != GATE_DRIVER_ACK_GET_STATUS1)
            {
                state = GATE_DRIVER_OP_TRYAGAIN;
                pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->status1Data.byte = (uint8_t)ackData[2];
            
            state = GATE_DRIVER_OP_DONE;
            if (pGateDriver->status0Data.byte)
            {
                state = GATE_DRIVER_OP_ERROR;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            if (pGateDriver->status1Data.byte > GATE_DRIVER_STATUS1_ERRATA_MASK)
            {
                state = GATE_DRIVER_OP_ERROR;
                pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
            }
            pGateDriver->timeout = GATEDRIVER_STATUS_READ_INTERVAL;
            if (state == GATE_DRIVER_OP_DONE)
            {
                pGateDriver->tryAgainCount = 0;
            }
        break;
        default:
            state = GATE_DRIVER_OP_TRYAGAIN;
            pGateDriver->timeout = GATE_DRIVER_READSTATUS_TIMEOUT;
            pGateDriver->statusRegIndex = GATE_DRIVER_STATE_CMD_READ_STATUS0;
        break;
    }
    return state;
}

/**
 * Function to write to the Gate Driver
 * @param pHostInterface - pointer to the Host Interface
 * @param data - the data to be send out
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Write(&hostInterface,data);
 * </code>
 */
void HAL_GateDriver_Write(GATE_DRIVER_HOST_INTERFACE* pHostInterface,uint16_t data)
{ 
    if (pHostInterface->StatusBufferFullTransmitGet() == 0)
    {
        pHostInterface->DataWrite(data);
    }
}

/**
 * Function to Read Data from Gate Driver 
 * @param pHostInterface - pointer to the Host Interface
 * @return the data read from the Driver ; 
 *         Function returns GATE_DRIVER_INVALID_DATA if data is not available
 * @example
 * <code>
 * HAL_GateDriver_Read(&hostInterface);
 * </code>
 */
uint16_t HAL_GateDriver_Read(GATE_DRIVER_HOST_INTERFACE* pHostInterface)
{ 
    /** Function returns invalid data,if buffer is empty*/
    uint16_t data = GATE_DRIVER_INVALID_DATA;
    if (pHostInterface->IsReceiveBufferDataReady())
    {
        data = pHostInterface->DataRead();
    }
    return data;
}

/**
 * Implements scheduler and returns the status 
 * @param pTimeout - pointer to the scheduler counter
 * @return true =  timeout expired  false = timer is on and live
 * @example
 * <code>
 * HAL_GateDriver_SchedulerRun();
 * </code>
 */
static bool HAL_GateDriver_SchedulerRun(uint16_t *pTimeout) 
{ 
    if (*pTimeout == 0)
    {
        return true;
    }
    else
    {
        *pTimeout = *pTimeout - 1;
        return false;
    }
}

/**
 * Function to Initialize Communication  Channel .
 * @param pGateDriver - Gate Driver Data
 * @return true =  success  false = failed
 * @example
 * <code>
 * HAL_GateDriver_Initialize_CommunicationCHL(&inverterGateDriver[gateDriverID]);
 * </code>
 */
static bool HAL_GateDriver_Initialize_CommChannel(GATE_DRIVER_OBJ *pGateDriver)
{
    GATE_DRIVER_HOST_INTERFACE *pHostInterface = pGateDriver->pHostInterface;
    
    /* Resets Gate Driver Communication Interface Object */
    memset(pHostInterface,0,sizeof(GATE_DRIVER_HOST_INTERFACE));
    
    /* Identify and initialize Communication peripheral used for establishing
     * communication interface between gate driver and controller */
    pGateDriver->interfaceChannelID = BSP_GATE_DRIVER_INTERFACE_A_UARTMODULE;
    
    /* Initialize function pointer based on the communication module number.*/
    return HAL_GateDriver_HookUARTFunctions(pHostInterface,pGateDriver->interfaceChannelID);
}
/**
 * Function to initialize function pointer .The function assumes that 
 * appropriate UART header is included.
 * @param pHostInterface - pointer to host interface
 * @return true =  success  false = failed
 * @example
 * <code>
 * HAL_GateDriver_HookUARTFunctions(pHostInterface);
 * </code>
 */
static bool HAL_GateDriver_HookUARTFunctions(GATE_DRIVER_HOST_INTERFACE *pHostInterface,uint16_t interfaceChannelID)
{
    if (interfaceChannelID == BSP_GATE_DRIVER_INTERFACE_A_UARTMODULE)
    {
        /* Initialize function pointer based on the communication module number.*/
        pHostInterface->InterruptTransmitFlagClear = 
                UART2_InterruptTransmitFlagClear;
        pHostInterface->InterruptReceiveFlagClear = 
                UART2_InterruptReceiveFlagClear;
        pHostInterface->InterruptTransmitEnable = 
                UART2_InterruptTransmitEnable;
        pHostInterface->InterruptTransmitDisable = 
                UART2_InterruptTransmitDisable;
        pHostInterface->InterruptReceiveEnable = 
                UART2_InterruptReceiveEnable;
        pHostInterface->InterruptReceiveDisable = 
                UART2_InterruptReceiveDisable;
        pHostInterface->Initialize = 
                UART2_Initialize;
        pHostInterface->SpeedModeStandard = 
                UART2_SpeedModeStandard;
        pHostInterface->SpeedModeHighSpeed = 
                UART2_SpeedModeHighSpeed;
        pHostInterface->BaudRateDividerSet = 
                UART2_BaudRateDividerSet;
        pHostInterface->ModuleDisable = 
                UART2_ModuleDisable;
        pHostInterface->ModuleEnable = 
                UART2_ModuleEnable;
        pHostInterface->TransmitModeEnable = 
                UART2_TransmitModeEnable;
        pHostInterface->TransmitModeDisable = 
                UART2_TransmitModeDisable;
        pHostInterface->StatusBufferFullTransmitGet = 
                UART2_StatusBufferFullTransmitGet;
        pHostInterface->DataWrite = UART2_DataWrite;
        pHostInterface->DataRead = UART2_DataRead;
        pHostInterface->IsReceiveBufferDataReady = 
                UART2_IsReceiveBufferDataReady;
        pHostInterface->ReceiveBufferEmpty = 
                UART2_ReceiveBufferEmpty;

        pHostInterface->baudRatebps = 0;
        pHostInterface->periphClockHz = 0;
        pHostInterface->baudRateScaler = 
                GATE_DRIVER_COMM_BAUDRATE_SCALER;
        pHostInterface->status =
                GATE_DRIVER_INTERFACE_INITIALIZED;
        return true;
    }
    else
    {
        return false;
    }
}
/**
 * Function to clear the Fault. The function resets the chip enable pin 
 * of the gate driver(CE = 0) by holding the port pin 'LOW'.Then re enables 
 * after specific interval.
 * @param pGateDriver pointer to the gate driver data
 * @return None
 * @example
 * <code>
 * HAL_GateDriver_Enable(pGateDriver);
 * </code>
 */
void HAL_GateDriver_FaultClear(GATE_DRIVER_OBJ *pGateDriver)
{
    *(pGateDriver->chipEnablePort) &= ~pGateDriver->chipEnableMask; 
   __delay_us(GATE_DRIVER_FAULT_CLEARING_PULSE_WIDTH);
    *(pGateDriver->chipEnablePort) |= pGateDriver->chipEnableMask;
}

